
## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 7 to change, 25 to destroy.</code></pre>

* Create
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
* Update
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_key_vault_secret.create_updates_queue_listen_conn_str
  * azurerm_key_vault_secret.create_updates_queue_send_conn_str
  * azurerm_key_vault_secret.update_case_queue_listen_conn_str
  * azurerm_key_vault_secret.update_case_queue_send_conn_str
  * azurerm_resource_group.rg
  * module.application_insights.azurerm_application_insights.this
* Delete
  * azurerm_key_vault_secret.ecm_postgres_database
  * azurerm_key_vault_secret.ecm_postgres_host
  * azurerm_key_vault_secret.ecm_postgres_password
  * azurerm_key_vault_secret.ecm_postgres_port
  * azurerm_key_vault_secret.ecm_postgres_user
  * module.ecm-database.azurerm_postgresql_active_directory_administrator.admin
  * module.ecm-database.azurerm_resource_group.data-resourcegroup
  * module.ecm-database.azurerm_template_deployment.postgres-paas
  * module.ecm-database.null_resource.subnet_mappings[0]
  * module.ecm-database.null_resource.subnet_mappings[1]
  * module.ecm-database.null_resource.subnet_mappings[2]
  * module.ecm-database.null_resource.subnet_mappings[3]
  * module.ecm-database.null_resource.subnet_mappings[4]
  * module.ecm-database.null_resource.subnet_mappings[5]
  * module.ecm-database.null_resource.subnet_mappings[6]
  * module.ecm-database.null_resource.subnet_mappings[7]
  * module.ecm-database.null_resource.subnet_mappings[8]
  * module.ecm-database.null_resource.subnet_mappings[9]
  * module.ecm-database.random_string.password
* Replace
  * module.ecm-create-updates-queue.azurerm_servicebus_queue.servicebus_queue
  * module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.ecm-update-case-queue.azurerm_servicebus_queue.servicebus_queue
  * module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://ethos-shared-prod.vault.azure.net/secrets/app-insights-connection-string/398628b51d2c4a50ae68ad4a414f2ab1"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_listen_conn_str" {
        id                      = "https://ethos-shared-prod.vault.azure.net/secrets/create-updates-queue-listen-connection-string/95826d39d5b24e07aa049143fa6acf84"
        name                    = "create-updates-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.create_updates_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "create_updates_queue_send_conn_str" {
        id                      = "https://ethos-shared-prod.vault.azure.net/secrets/create-updates-queue-send-connection-string/0d7a97f4a30042909641f4ff0cd2f504"
        name                    = "create-updates-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.ecm_postgres_database will be destroyed
  # (because azurerm_key_vault_secret.ecm_postgres_database is not in configuration)
  - resource "azurerm_key_vault_secret" "ecm_postgres_database" {
      - id                      = "https://ethos-shared-prod.vault.azure.net/secrets/ecm-consumer-postgres-database/caf0be12ff1e4337b206a99cea96078f" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod" -> null
      - name                    = "ecm-consumer-postgres-database" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod/secrets/ecm-consumer-postgres-database/versions/caf0be12ff1e4337b206a99cea96078f" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod/secrets/ecm-consumer-postgres-database" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "caf0be12ff1e4337b206a99cea96078f" -> null
      - versionless_id          = "https://ethos-shared-prod.vault.azure.net/secrets/ecm-consumer-postgres-database" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.ecm_postgres_host will be destroyed
  # (because azurerm_key_vault_secret.ecm_postgres_host is not in configuration)
  - resource "azurerm_key_vault_secret" "ecm_postgres_host" {
      - id                      = "https://ethos-shared-prod.vault.azure.net/secrets/ecm-consumer-postgres-host/b29c0afde36e4abc84587d20951beeba" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod" -> null
      - name                    = "ecm-consumer-postgres-host" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod/secrets/ecm-consumer-postgres-host/versions/b29c0afde36e4abc84587d20951beeba" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod/secrets/ecm-consumer-postgres-host" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "b29c0afde36e4abc84587d20951beeba" -> null
      - versionless_id          = "https://ethos-shared-prod.vault.azure.net/secrets/ecm-consumer-postgres-host" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.ecm_postgres_password will be destroyed
  # (because azurerm_key_vault_secret.ecm_postgres_password is not in configuration)
  - resource "azurerm_key_vault_secret" "ecm_postgres_password" {
      - id                      = "https://ethos-shared-prod.vault.azure.net/secrets/ecm-consumer-postgres-password/57bff5c0bc494d5884c41a31e0159f03" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod" -> null
      - name                    = "ecm-consumer-postgres-password" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod/secrets/ecm-consumer-postgres-password/versions/57bff5c0bc494d5884c41a31e0159f03" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod/secrets/ecm-consumer-postgres-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "57bff5c0bc494d5884c41a31e0159f03" -> null
      - versionless_id          = "https://ethos-shared-prod.vault.azure.net/secrets/ecm-consumer-postgres-password" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.ecm_postgres_port will be destroyed
  # (because azurerm_key_vault_secret.ecm_postgres_port is not in configuration)
  - resource "azurerm_key_vault_secret" "ecm_postgres_port" {
      - id                      = "https://ethos-shared-prod.vault.azure.net/secrets/ecm-consumer-postgres-port/2ab77b5221d24a32bfb91a2d4edfab38" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod" -> null
      - name                    = "ecm-consumer-postgres-port" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod/secrets/ecm-consumer-postgres-port/versions/2ab77b5221d24a32bfb91a2d4edfab38" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod/secrets/ecm-consumer-postgres-port" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "2ab77b5221d24a32bfb91a2d4edfab38" -> null
      - versionless_id          = "https://ethos-shared-prod.vault.azure.net/secrets/ecm-consumer-postgres-port" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.ecm_postgres_user will be destroyed
  # (because azurerm_key_vault_secret.ecm_postgres_user is not in configuration)
  - resource "azurerm_key_vault_secret" "ecm_postgres_user" {
      - id                      = "https://ethos-shared-prod.vault.azure.net/secrets/ecm-consumer-postgres-user/557ce7d5150e4a5790263a6b076973e9" -> null
      - key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod" -> null
      - name                    = "ecm-consumer-postgres-user" -> null
      - resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod/secrets/ecm-consumer-postgres-user/versions/557ce7d5150e4a5790263a6b076973e9" -> null
      - resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.KeyVault/vaults/ethos-shared-prod/secrets/ecm-consumer-postgres-user" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "557ce7d5150e4a5790263a6b076973e9" -> null
      - versionless_id          = "https://ethos-shared-prod.vault.azure.net/secrets/ecm-consumer-postgres-user" -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_listen_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_listen_conn_str" {
        id                      = "https://ethos-shared-prod.vault.azure.net/secrets/update-case-queue-listen-connection-string/8c5790f6fcba498a9a55762e6e56630e"
        name                    = "update-case-queue-listen-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.update_case_queue_send_conn_str will be updated in-place
  ~ resource "azurerm_key_vault_secret" "update_case_queue_send_conn_str" {
        id                      = "https://ethos-shared-prod.vault.azure.net/secrets/update-case-queue-send-connection-string/5fe4f8bb72504c0dbe4e39f2d7a91405"
        name                    = "update-case-queue-send-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod"
        name       = "ethos-prod"
      ~ tags       = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "builtFrom"    = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          - "businessArea" = "CFT"
          - "environment"  = "prod"
          - "lastUpdated"  = "2023-10-04T17:23:30Z"
          - "managedBy"    = "ECM Project"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  # (moved from azurerm_application_insights.appinsights)
  ~ resource "azurerm_application_insights" "this" {
      ~ daily_data_cap_in_gb                  = 100 -> 50
      ~ daily_data_cap_notifications_disabled = false -> true
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.Insights/components/ethos-prod"
        name                                  = "ethos-prod"
        tags                                  = {
            "application"         = "ethos"
            "builtFrom"           = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ethos-repl-service"
            "environment"         = "production"
            "managedBy"           = "Ethos Replacement"
        }
        # (14 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be created
  + resource "azurerm_monitor_activity_log_alert" "main" {
      + description         = "Monitors for application insight reaching it's daily cap."
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "Application Insights daily cap reached - ethos-prod"
      + resource_group_name = "ethos-prod"
      + scopes              = [
          + "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.Insights/components/ethos-prod",
        ]
      + tags                = {
          + "application"         = "ethos"
          + "builtFrom"           = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#ethos-repl-service"
          + "environment"         = "production"
          + "managedBy"           = "Ethos Replacement"
        }

      + action {
          + action_group_id    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/cft-alerts-slack-warning-alerts"
          + webhook_properties = {
              + "from"           = "terraform"
              + "slackChannelId" = "CHB46SFNU"
            }
        }

      + criteria {
          + category       = "Administrative"
          + level          = "Warning"
          + operation_name = "Microsoft.Insights/Components/DailyCapReached/Action"
          + resource_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.Insights/components/ethos-prod"
        }
    }

  # module.ecm-create-updates-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "ethos-sb-prod"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "ethos-prod"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod/queues/create-updates" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "create-updates"
      ~ namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod" # forces replacement -> (known after apply) # forces replacement
        # (15 unchanged attributes hidden)
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod/queues/create-updates/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.ecm-create-updates-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod/queues/create-updates/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod/queues/create-updates" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.ecm-database.azurerm_postgresql_active_directory_administrator.admin will be destroyed
  # (because azurerm_postgresql_active_directory_administrator.admin is not in configuration)
  - resource "azurerm_postgresql_active_directory_administrator" "admin" {
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-shared-ecm-db-data-prod/providers/Microsoft.DBforPostgreSQL/servers/ethos-shared-ecm-db-prod" -> null
      - login               = "DTS Platform Operations SC" -> null
      - object_id           = "4d0554dd-fe60-424a-be9c-36636826d927" -> null
      - resource_group_name = "ethos-shared-ecm-db-data-prod" -> null
      - server_name         = "ethos-shared-ecm-db-prod" -> null
      - tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.ecm-database.azurerm_resource_group.data-resourcegroup will be destroyed
  # (because azurerm_resource_group.data-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "data-resourcegroup" {
      - id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-shared-ecm-db-data-prod" -> null
      - location   = "uksouth" -> null
      - name       = "ethos-shared-ecm-db-data-prod" -> null
      - tags       = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#ethos-repl-service"
          - "application"  = "ethos"
          - "builtFrom"    = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
          - "businessArea" = "CFT"
          - "environment"  = "prod"
          - "managedBy"    = "ECM Project"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.ecm-database.azurerm_template_deployment.postgres-paas will be destroyed
  # (because azurerm_template_deployment.postgres-paas is not in configuration)
  - resource "azurerm_template_deployment" "postgres-paas" {
      - deployment_mode     = "Incremental" -> null
      - id                  = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-shared-ecm-db-data-prod/providers/Microsoft.Resources/deployments/ethos-shared-ecm-db-prod" -> null
      - name                = "ethos-shared-ecm-db-prod" -> null
      - outputs             = {} -> null
      - parameters          = {
          - "administratorLogin"         = "ecmconsumer"
          - "administratorLoginPassword" = "7)#Q?r}2ZJ[g&wph"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJEZXN0cm95IE1lIjoiTm8iLCJUZWFtIENvbnRhY3QiOiIjZXRob3MtcmVwbC1zZXJ2aWNlIiwiYXBwbGljYXRpb24iOiJldGhvcyIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9lY20tc2hhcmVkLWluZnJhc3RydWN0dXJlLmdpdCIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImVudmlyb25tZW50IjoicHJvZCIsIm1hbmFnZWRCeSI6IkVDTSBQcm9qZWN0In0="
          - "dbName"                     = "ecmconsumer"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODk5OWRlYzMtMDEwNC00YTI3LTk0ZWUtNjU4ODU1OTcyOWQxL3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtcHJvZC9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1wcm9kL3N1Ym5ldHMvY29yZS1pbmZyYS1zdWJuZXQtMy1wcm9kIn0seyJydWxlX25hbWUiOiJjZnQtdGYtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84Y2JjNmYzNi03YzU2LTQ5NjMtOWQzNi03MzlkYjVkMDBiMjcvcmVzb3VyY2VHcm91cHMvY2Z0LXByb2QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6ImNmdC10Zi1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzhjYmM2ZjM2LTdjNTYtNDk2My05ZDM2LTczOWRiNWQwMGIyNy9yZXNvdXJjZUdyb3Vwcy9jZnQtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXByb2Qtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvaWFhcyJ9LHsicnVsZV9uYW1lIjoiamVua2lucy1ha3MtYWdlbnQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYmFmNTQ3MC0xYzNlLTQwZDMtYTZmNy03NGJmYmNlNGIzNDgvcmVzb3VyY2VHcm91cHMvY2Z0LXB0bC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY2Z0LXB0bC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJpZGFtLXByb2QyLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy84OTk5ZGVjMy0wMTA0LTRhMjctOTRlZS02NTg4NTU5NzI5ZDEvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1pZGFtLXByb2QyL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWlkYW0tcHJvZDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tcHJvZDIifSx7InJ1bGVfbmFtZSI6ImJhc3Rpb24tcHJvZC12bmV0Iiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMmIxYWZjMTktNWNhOS00Nzk2LWE1NmYtNTc0YTU4NjcwMjQ0L3Jlc291cmNlR3JvdXBzL2Jhc3Rpb24tcHJvZC1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2Jhc3Rpb24tcHJvZC12bmV0L3N1Ym5ldHMvYmFzdGlvbiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXByb2QtYWtzMDAiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy81Y2E2MjAyMi02YWEyLTRjZWUtYWFhNy1lNzUzNmM4ZDU2NmMvcmVzb3VyY2VHcm91cHMvc3MtcHJvZC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtcHJvZC12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtcHJvZC1ha3MwMSIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzVjYTYyMDIyLTZhYTItNGNlZS1hYWE3LWU3NTM2YzhkNTY2Yy9yZXNvdXJjZUdyb3Vwcy9zcy1wcm9kLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1wcm9kLXZuZXQvc3VibmV0cy9ha3MtMDEifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1kYXRhLWdhdGV3YXktcHJvZCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzA5NzgzMTVjLTc1ZmUtNGFkYS05ZDExLTFlYjVlMGUwYjIxNC9yZXNvdXJjZUdyb3Vwcy9obWN0cy1odWItcHJvZC1pbnQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9obWN0cy1odWItcHJvZC1pbnQvc3VibmV0cy9zaGFyZWQtZGF0YS1nYXRld2F5In1d"
          - "env"                        = "prod"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "ethos-shared-ecm-db-prod"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> null
      - resource_group_name = "ethos-shared-ecm-db-data-prod" -> null
      - template_body       = jsonencode(
            {
              - "$schema"      = "http://schema.management.azure.com/schemas/2014-04-01-preview/deploymentTemplate.json#"
              - contentVersion = "1.0.0.0"
              - parameters     = {
                  - administratorLogin         = {
                      - maxLength = 16
                      - minLength = 1
                      - type      = "string"
                    }
                  - administratorLoginPassword = {
                      - type = "securestring"
                    }
                  - backupRetentionDays        = {
                      - defaultValue = 7
                      - type         = "string"
                    }
                  - charset                    = {
                      - type = "string"
                    }
                  - collation                  = {
                      - type = "string"
                    }
                  - commonTags                 = {
                      - type = "string"
                    }
                  - dbName                     = {
                      - type = "string"
                    }
                  - dbRules                    = {
                      - type = "string"
                    }
                  - env                        = {
                      - metadata = {
                          - description = "The tag"
                        }
                      - type     = "string"
                    }
                  - geoRedundantBackup         = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - location                   = {
                      - allowedValues = [
                          - "UK West",
                          - "ukwest",
                          - "UK South",
                          - "uksouth",
                        ]
                      - defaultValue  = "UK South"
                      - type          = "string"
                    }
                  - serverName                 = {
                      - maxLength = 63
                      - minLength = 2
                      - type      = "string"
                    }
                  - skuCapacity                = {
                      - defaultValue = 2
                      - type         = "string"
                    }
                  - skuFamily                  = {
                      - allowedValues = [
                          - "Gen5",
                        ]
                      - defaultValue  = "Gen5"
                      - type          = "string"
                    }
                  - skuName                    = {
                      - allowedValues = [
                          - "B_Gen5_1",
                          - "B_Gen5_2",
                          - "GP_Gen5_2",
                          - "GP_Gen5_4",
                          - "GP_Gen5_8",
                          - "GP_Gen5_16",
                          - "GP_Gen5_32",
                          - "MO_Gen5_2",
                          - "MO_Gen5_4",
                          - "MO_Gen5_8",
                          - "MO_Gen5_16",
                          - "MO_Gen5_32",
                        ]
                      - defaultValue  = "GP_Gen5_2"
                      - type          = "string"
                    }
                  - skuSizeMB                  = {
                      - defaultValue = "51200"
                      - type         = "string"
                    }
                  - skuTier                    = {
                      - allowedValues = [
                          - "Basic",
                          - "GeneralPurpose",
                          - "MemoryOptimized",
                        ]
                      - defaultValue  = "GeneralPurpose"
                      - type          = "string"
                    }
                  - sslEnforcement             = {
                      - defaultValue = "Enabled"
                      - type         = "string"
                    }
                  - version                    = {
                      - allowedValues = [
                          - "9.5",
                          - "9.6",
                          - "10",
                          - "11",
                        ]
                      - defaultValue  = "9.6"
                      - type          = "string"
                    }
                }
              - resources      = [
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - kind       = ""
                      - location   = "[parameters('location')]"
                      - name       = "[parameters('serverName')]"
                      - properties = {
                          - administratorLogin         = "[parameters('administratorLogin')]"
                          - administratorLoginPassword = "[parameters('administratorLoginPassword')]"
                          - sslEnforcement             = "[parameters('sslEnforcement')]"
                          - storageProfile             = {
                              - backupRetentionDays = "[int(parameters('backupRetentionDays'))]"
                              - geoRedundantBackup  = "[parameters('geoRedundantBackup')]"
                              - storageMB           = "[parameters('skuSizeMB')]"
                            }
                          - version                    = "[parameters('version')]"
                        }
                      - resources  = [
                          - {
                              - apiVersion = "2017-12-01-preview"
                              - dependsOn  = [
                                  - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                                ]
                              - name       = "[parameters('dbName')]"
                              - properties = {
                                  - charset   = "[parameters('charset')]"
                                  - collation = "[parameters('collation')]"
                                }
                              - type       = "databases"
                            },
                        ]
                      - sku        = {
                          - capacity = "[parameters('skuCapacity')]"
                          - family   = "[parameters('skuFamily')]"
                          - name     = "[parameters('skuName')]"
                          - size     = "[parameters('skuSizeMB')]"
                          - tier     = "[parameters('skuTier')]"
                        }
                      - tags       = "[variables('tags')]"
                      - type       = "Microsoft.DBforPostgreSQL/servers"
                    },
                  - {
                      - apiVersion = "2017-12-01-preview"
                      - copy       = {
                          - count = "[length(variables('dbRules'))]"
                          - name  = "storagecopy"
                        }
                      - dependsOn  = [
                          - "[concat('Microsoft.DBforPostgreSQL/servers/', parameters('serverName'))]",
                        ]
                      - location   = "[parameters('location')]"
                      - name       = "[concat(parameters('serverName'), '/', variables('dbRules')[copyIndex()].rule_name)]"
                      - properties = {
                          - ignoreMissingVnetServiceEndpoint = true
                          - virtualNetworkSubnetId           = "[variables('dbRules')[copyIndex()].subnet_id]"
                        }
                      - type       = "Microsoft.DBforPostgreSQL/servers/virtualNetworkRules"
                    },
                ]
              - variables      = {
                  - dbRules = "[base64ToJson(parameters('dbRules'))]"
                  - tags    = "[base64ToJson(parameters('commonTags'))]"
                }
            }
        ) -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[0] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1337172182700113225" -> null
      - triggers = {
          - "rule_name" = "ase"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-3-prod"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[1] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "8674665223082153551" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks00"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[2] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "4037200794235010051" -> null
      - triggers = {
          - "rule_name" = "cft-tf-aks01"
          - "subnet_id" = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[3] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5577006791947779410" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/iaas"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[4] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6334824724549167320" -> null
      - triggers = {
          - "rule_name" = "jenkins-aks-agent"
          - "subnet_id" = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/cft-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/cft-ptl-vnet/subnets/aks-00"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[5] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "6129484611666145821" -> null
      - triggers = {
          - "rule_name" = "idam-prod2-vnet"
          - "subnet_id" = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-idam-prod2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-prod2/subnets/core-infra-subnet-7-idam-prod2"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[6] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "605394647632969758" -> null
      - triggers = {
          - "rule_name" = "bastion-prod-vnet"
          - "subnet_id" = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/bastion-prod-rg/providers/Microsoft.Network/virtualNetworks/bastion-prod-vnet/subnets/bastion"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[7] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "1443635317331776148" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks00"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-00"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[8] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "3916589616287113937" -> null
      - triggers = {
          - "rule_name" = "shared-services-prod-aks01"
          - "subnet_id" = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/ss-prod-network-rg/providers/Microsoft.Network/virtualNetworks/ss-prod-vnet/subnets/aks-01"
        } -> null
    }

  # module.ecm-database.null_resource.subnet_mappings[9] will be destroyed
  # (because null_resource.subnet_mappings is not in configuration)
  - resource "null_resource" "subnet_mappings" {
      - id       = "5218971275363550622" -> null
      - triggers = {
          - "rule_name" = "shared-data-gateway-prod"
          - "subnet_id" = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/virtualNetworks/hmcts-hub-prod-int/subnets/shared-data-gateway"
        } -> null
    }

  # module.ecm-database.random_string.password will be destroyed
  # (because random_string.password is not in configuration)
  - resource "random_string" "password" {
      - id          = "7)#Q?r}2ZJ[g&wph" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = "7)#Q?r}2ZJ[g&wph" -> null
      - special     = true -> null
      - upper       = true -> null
    }

  # module.ecm-update-case-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "ethos-sb-prod"
      + premium_messaging_partitions        = (known after apply)
      + resource_group_name                 = "ethos-prod"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod/queues/update-case" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "update-case"
      ~ namespace_id                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod" # forces replacement -> (known after apply) # forces replacement
        # (15 unchanged attributes hidden)
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod/queues/update-case/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.ecm-update-case-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod/queues/update-case/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.ServiceBus/namespaces/ethos-sb-prod/queues/update-case" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 7 to add, 7 to change, 25 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  # (moved from azurerm_application_insights.appinsights)
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ethos-prod/providers/Microsoft.Insights/components/ethos-prod"
        name                                  = "ethos-prod"
        tags                                  = {
            "application"         = "ethos"
            "builtFrom"           = "https://github.com/HMCTS/ecm-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ethos-repl-service"
            "environment"         = "production"
            "managedBy"           = "Ethos Replacement"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":88,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->